In [1]:
import pandas as pd

# Load the messy data
df = pd.read_excel("messy_sales_data.xlsx")

# Show the first few rows
df.head()

        Customer Name     Product Region  Units Sold  Unit Price Date of Sale
0   milica golubovic       Laptop  north        10.0      1000.0   2023-01-15
1            John DOE      Tablet  SOUTH         NaN       500.0   2023/02/20
2           ana MARIC  Smartphone   East        25.0       700.0   15-03-2023
3    Milica Golubovic      Laptop  north        10.0      1000.0   2023-01-15
4            JOHN doe      Tablet  south        15.0         NaN   2023/02/20

In [2]:
# Strip whitespace and fix capitalization in customer names
df["Customer Name"] = df["Customer Name"].str.strip().str.title()

In [3]:
df["Region"] = df["Region"].str.strip().str.title()

In [4]:
df.duplicated().sum()

np.int64(2)

In [5]:
df.drop_duplicates(inplace=True)

In [6]:
df.isnull().sum()

Customer Name    1
Product          0
Region           0
Units Sold       1
Unit Price       1
Date of Sale     0
dtype: int64

In [8]:
df["Units Sold"] = df["Units Sold"].fillna(0)
df["Unit Price"] = df["Unit Price"].fillna(df["Unit Price"].median())

In [9]:
df["Date of Sale"] = pd.to_datetime(df["Date of Sale"], errors="coerce")

In [10]:
df["Total Sales"] = df["Units Sold"] * df["Unit Price"]

In [11]:
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 0 to 5
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Customer Name  4 non-null      object
 1   Product        5 non-null      object
 2   Region         5 non-null      object
 3   Units Sold     5 non-null      float64
 4   Unit Price     5 non-null      float64
 5   Date of Sale   1 non-null      datetime64[ns]
 6   Total Sales    5 non-null      float64
dtypes: datetime64[ns](1), float64(3), object(3)
memory usage: 320.0+ bytes

,Customer Name,Product,Region,Units Sold,Unit Price,Date of Sale,Total Sales
0,Milica Golubovic,Laptop,North,10.0,1000.0,2023-01-15,10000.0
1,John Doe,Tablet,South,0.0,500.0,NaT,0.0
2,Ana Maric,Smartphone,East,25.0,700.0,NaT,17500.0
4,John Doe,Tablet,South,15.0,700.0,NaT,10500.0
5,NaN,Smartphone,East,20.0,700.0,NaT,14000.0

In [12]:
df.to_excel("cleaned_sales_data.xlsx", index=False)